tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap 'homebrew/cask-drivers'
tap "homebrew/core"
tap "homebrew/services"
tap "nanovms/qemu"
brew "bash"
brew "zsh"
brew "antigen"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "blueutil"
brew "boost"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "cmake"
brew "composer"
brew "coreutils"
brew "dive"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "freetds"
brew "fswatch"
brew "git"
brew "gnupg"
brew "helm"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "k9s"
brew "lazydocker"
brew "llvm"
brew "opencv"
brew "php"
brew "php@7.4"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "qemu"
brew "redis"
brew "scrcpy"
brew "sleepwatcher"
brew "socat"
brew "ssh-copy-id"
brew "tree"
brew "wget"
brew "thefuck"
brew "golang"
brew "http-server"
brew "svn" # download fonts


cask "clion"
cask "dingtalk"
cask "discord"

cask "font-hack", args: { appdir: "/Applications" }
cask "font-source-code-pro", args: { appdir: "/Applications" }
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-inter'
cask 'font-jetbrains-mono'


cask "google-chrome"
cask "iina", args: { appdir: "/Applications" }
cask "insomnia"
cask "keka", args: { appdir: "/Applications" }
cask "lens"
cask "qlcolorcode", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "qq"
cask "stats"
cask "telegram", args: { appdir: "/Applications" }
cask "tencent-meeting"
cask "termius"
cask "typora"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "webstorm"
cask "phpstorm"
cask 'docker'
cask 'iterm2'
cask 'alfred'
cask 'notion'
cask 'AlDente'
cask 'logitech-options'
cask 'spotify'
cask 'neteasemusic'
cask 'wechat'
cask 'bitwarden'
cask 'v2rayu'
