cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'ffmpeg'
#brew 'git-flow'
brew 'gnupg'
brew 'gnupg2'
#brew 'go'
#brew 'grc'
brew 'httpie'
#brew 'irssi'
#brew 'mackup'
#brew 'mongodb'
#brew 'nvm'
#brew 'opencc'
brew 'pyenv'
#brew 'rethinkdb'
brew 'ssh-copy-id'
#brew 'terraform'
brew 'trash'
brew 'tree'
#brew 'unrar'
brew 'htop'
brew 'bat'
brew 'k9s'
brew 'svn'

#brew 'youtube-dl'

cask 'alfred'
#cask 'atom'
#cask 'beyond-compare'
cask 'charles'
#cask 'cleanmymac'
cask 'docker'
#cask 'dropbox'
#cask 'firefoxdeveloperedition'
#cask 'flux'
#cask 'gitter'
#cask 'google-chrome'
#cask 'heroku-toolbelt'
cask 'stats'

cask 'iterm2'
cask 'keka'
#cask 'macdown'
cask 'neteasemusic'
#cask 'ngrok'
#cask 'obs'
#cask 'paw'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
#cask 'recordit'
#cask 'robomongo'
#cask 'sketch'
#cask 'sketch-toolbox'
#cask 'skype'
#cask 'slack'
#cask 'sourcetree'
#cask 'spectacle'
#cask 'spotify'
#cask 'steam'
#cask 'sublime-text3'
cask 'telegram'
#cask 'tiled'
#cask 'unity'
#cask 'utorrent'
#cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'iina'
cask 'phpstorm'
cask 'goland'
cask 'pycharm'

cask 'font-hack'
cask 'font-source-code-pro'
